app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "body", "completed", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Finish this video"], ["body", "edit and upload"], ["completed", 0], ["user_id", 1], ["created_at", "2022-10-28 16:04:52.381671"], ["updated_at", "2022-10-28 16:04:52.381671"]]
---
  def create
    @task = Task.new(task_params)
    @task.user = current_user
    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2022-10-28 16:27:03.733521"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)